---
type: GBXMLExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# GBXMLExportOptions

`Autodesk.Revit.DB.GBXMLExportOptions` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | GBXMLExportOptions | 2015 | `public GBXMLExportOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Encoding | 2020 | `public string Encoding { get ; }` |
| Property | ExportAnalyticalSystems | 2020.1 | `public bool ExportAnalyticalSystems { get ; set ; }` |
| Property | ExportEnergyModelType | 2015 | `public ExportEnergyModelType ExportEnergyModelType { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |